mhomran/STM32_Bootloader/src/Uart/Uart.c
/**
 * @file Uart.c
 * @author Mohamed Hassanin
 * @brief A Uart driver to pack the hex formated packet and send it to
 * UartIf.
 * @version 0.1
 * @date 2021-07-26
 * 
 * @copyright Copyright (c) 2021
 * 
 */
#define UART_HW_NO 1

#define HEX_FRAME_HEADER_SIZE 8 //1 len, 2 addr, 1 type, 4 CRC
#define HEX_FRAME_MAX_DATA_BUFF_SIZE 16
#define HEX_FRAME_MAX_SIZE (HEX_FRAME_HEADER_SIZE + HEX_FRAME_MAX_DATA_BUFF_SIZE)

#define HEX_LEN_OFFSET 0
#define HEX_ADDR_OFFSET 1
#define HEX_TYPE_OFFSET 3
#define HEX_DATA_OFFSET 4

#include "stm32f4xx_hal.h"
#include "Uart.h"
#include "UartIf.h"
#include "UartIf_Cfg.h"
#include "port.h"
#include "PduR_Cfg.h"

typedef struct {
  uint8_t len;
  uint16_t addr;
  uint8_t* data;
  uint8_t type;
  uint32_t crc; 
} HexFormat_t;

typedef enum
{
  HEX_STATE_LEN,
  HEX_STATE_ADDR,
  HEX_STATE_TYPE,
  HEX_STATE_DATA,
  HEX_STATE_CRC
}HexState_t;

UART_HandleTypeDef gUart1Handle;
DMA_HandleTypeDef gDma2Usart1TxHandle;
DMA_HandleTypeDef gDma2Usart1RxHandle;

static HexFormat_t gRxHexFrame;
static uint8_t gRxHexFrameDataBuff[HEX_FRAME_MAX_DATA_BUFF_SIZE];
static uint8_t gTxHexFrameDataBuff[HEX_FRAME_MAX_DATA_BUFF_SIZE];

static PduInfo_t gUartIfPdu;
static uint8_t gUartIfPduDataBuff[HEX_FRAME_MAX_SIZE];

static uint8_t gUartHwTxPduId[UART_HW_NO];

inline static void Uart_StateMachine(void);

void 
HAL_UART_MspInit(UART_HandleTypeDef *hsart)
{
  if(hsart->Instance==USART1)
    {
      __HAL_RCC_USART1_CLK_ENABLE();
      __HAL_RCC_GPIOB_CLK_ENABLE();
      __HAL_RCC_DMA2_CLK_ENABLE();

      GPIO_InitTypeDef GPIO_InitStruct = {0};

      GPIO_InitStruct.Pin = USART1_TX_PIN | USART1_RX_PIN;
      GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
      GPIO_InitStruct.Pull = GPIO_NOPULL;
      GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
      GPIO_InitStruct.Alternate = GPIO_AF7_USART1;
      HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

      gDma2Usart1TxHandle.Instance = DMA2_Stream7;
      gDma2Usart1TxHandle.Init.Channel = DMA_CHANNEL_4;
      gDma2Usart1TxHandle.Init.Direction = DMA_MEMORY_TO_PERIPH;
      gDma2Usart1TxHandle.Init.PeriphInc = DMA_PINC_DISABLE;
      gDma2Usart1TxHandle.Init.MemInc = DMA_MINC_ENABLE;
      gDma2Usart1TxHandle.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
      gDma2Usart1TxHandle.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
      gDma2Usart1TxHandle.Init.Mode = DMA_NORMAL;
      gDma2Usart1TxHandle.Init.Priority = DMA_PRIORITY_LOW;
      gDma2Usart1TxHandle.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
      if (HAL_DMA_Init(&gDma2Usart1TxHandle) != HAL_OK)
        {
        }

      __HAL_LINKDMA(&gUart1Handle,hdmatx,gDma2Usart1TxHandle);

      /* USART1_RX Init */
      gDma2Usart1RxHandle.Instance = DMA2_Stream2;
      gDma2Usart1RxHandle.Init.Channel = DMA_CHANNEL_4;
      gDma2Usart1RxHandle.Init.Direction = DMA_PERIPH_TO_MEMORY;
      gDma2Usart1RxHandle.Init.PeriphInc = DMA_PINC_DISABLE;
      gDma2Usart1RxHandle.Init.MemInc = DMA_MINC_ENABLE;
      gDma2Usart1RxHandle.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
      gDma2Usart1RxHandle.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
      gDma2Usart1RxHandle.Init.Mode = DMA_NORMAL;
      gDma2Usart1RxHandle.Init.Priority = DMA_PRIORITY_LOW;
      gDma2Usart1RxHandle.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
      if (HAL_DMA_Init(&gDma2Usart1RxHandle) != HAL_OK)
        {
        }

      __HAL_LINKDMA(&gUart1Handle,hdmarx,gDma2Usart1RxHandle);

      /* USART1 interrupt Init */
      HAL_NVIC_SetPriority(USART1_IRQn, TICK_INT_PRIORITY+1, 0);
      HAL_NVIC_EnableIRQ(USART1_IRQn);
      HAL_NVIC_SetPriority(DMA2_Stream7_IRQn, TICK_INT_PRIORITY+2, 0);
      HAL_NVIC_EnableIRQ(DMA2_Stream7_IRQn);
      HAL_NVIC_SetPriority(DMA2_Stream2_IRQn, TICK_INT_PRIORITY+3, 0);
      HAL_NVIC_EnableIRQ(DMA2_Stream2_IRQn);
    }
}

void 
Uart_Init(void)
{
  gUart1Handle.Instance = USART1;

  gUart1Handle.Init.BaudRate = 9600;
  gUart1Handle.Init.WordLength = UART_WORDLENGTH_8B;
  gUart1Handle.Init.StopBits = UART_STOPBITS_1;
  gUart1Handle.Init.Parity = UART_PARITY_NONE;
  gUart1Handle.Init.Mode = UART_MODE_TX_RX;

  if (HAL_UART_Init(&gUart1Handle) != HAL_OK)
    {
      
    }

  if(HAL_OK != HAL_UART_Receive_DMA(&gUart1Handle, &(gRxHexFrame.len), sizeof(gRxHexFrame.len)))
    {
    }

  gRxHexFrame.data = gRxHexFrameDataBuff;
  gUartIfPdu.data = gUartIfPduDataBuff;
}

StdReturn_t 
Uart_Write(UartHw_t Uart, UartPdu_t* UartPdu)
{
  switch(Uart)
  {
    case UART_HW_1:
      {
        //TODO: remove the length byte when you implement idle line
        gTxHexFrameDataBuff[HEX_LEN_OFFSET] = UartPdu->len - 3; //- (type+address)
        gTxHexFrameDataBuff[HEX_ADDR_OFFSET] = UartPdu->data[0];
        gTxHexFrameDataBuff[HEX_ADDR_OFFSET+1] = UartPdu->data[1];
        gTxHexFrameDataBuff[HEX_TYPE_OFFSET] = UartPdu->data[2];
        uint8_t i;
        for(i = 0; i < gTxHexFrameDataBuff[HEX_LEN_OFFSET]; i++)
          {
            gTxHexFrameDataBuff[HEX_DATA_OFFSET+i] = UartPdu->data[i+3];
          }

        //gTxHexFrameDataBuff[i] = dummy crc

        if(HAL_OK != HAL_UART_Transmit_DMA(&gUart1Handle, gTxHexFrameDataBuff, 
        gTxHexFrameDataBuff[HEX_LEN_OFFSET] + HEX_FRAME_HEADER_SIZE))
          {
            return E_NOT_OK;
          }
        gUartHwTxPduId[UART_HW_1] = UartPdu->pduid;
      }
      break;
    default:
      {
        return E_NOT_OK;
      }
      break;
  } 

  return E_OK;
}

/**
  * @brief  Rx Transfer completed callbacks.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval None
  */
void 
HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
  if(huart->Instance == USART1)
    {
      Uart_StateMachine();   
    }
}

/**
  * @brief  Tx Transfer completed callbacks.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval None
  */
void 
HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
  if(huart->Instance == USART1)
    {
      UartIf_TxConfirmation(gUartHwTxPduId[UART_HW_1]);
    }
}

/**
 * @brief state machine for the HEX file parsing
 * 
 */
inline static void
Uart_StateMachine(void)
{
  static HexState_t state = HEX_STATE_LEN;
  
  switch(state) 
  {
    case HEX_STATE_LEN:
      {
        state = HEX_STATE_ADDR;
        if(HAL_OK != HAL_UART_Receive_DMA(&gUart1Handle, (uint8_t*)&(gRxHexFrame.addr),
         sizeof(gRxHexFrame.addr))) 
          {
          }
      }
      break;
    case HEX_STATE_ADDR:
      {
        state = HEX_STATE_TYPE;
        if(HAL_OK != HAL_UART_Receive_DMA(&gUart1Handle, &(gRxHexFrame.type),
         sizeof(gRxHexFrame.type)))
          {
          }
      }
      break;
    case HEX_STATE_TYPE:
      {
        if(gRxHexFrame.len != 0)
          {
            state = HEX_STATE_DATA;
            if(HAL_OK != HAL_UART_Receive_DMA(&gUart1Handle, gRxHexFrame.data, gRxHexFrame.len))
              {
              }
          }
        else
          {
            state = HEX_STATE_CRC;
            if(HAL_OK != HAL_UART_Receive_DMA(&gUart1Handle, (uint8_t*)&(gRxHexFrame.crc),
            sizeof(gRxHexFrame.crc)))
              {
              }
          }
      }
      break;
    case HEX_STATE_DATA:
      {
        state = HEX_STATE_CRC;
        if(HAL_OK != HAL_UART_Receive_DMA(&gUart1Handle, (uint8_t*)&(gRxHexFrame.crc),
        sizeof(gRxHexFrame.crc)))
          {
          }
      }
      break;
    case HEX_STATE_CRC:
      {
        gUartIfPdu.len = gRxHexFrame.len + HEX_FRAME_HEADER_SIZE 
        - sizeof(gRxHexFrame.len) - sizeof(gRxHexFrame.crc);

        gUartIfPdu.data[0] = (uint8_t)(gRxHexFrame.addr & 0xFF);
        gUartIfPdu.data[1] = (uint8_t)((gRxHexFrame.addr & 0xFF00) >> 8);
        gUartIfPdu.data[2] = gRxHexFrame.type;
        for(uint8_t i = 0; i < gRxHexFrame.len; i++)
          {
            gUartIfPdu.data[4+i] = gRxHexFrame.data[i];
          }
        
        UartIf_RxIndication(UART_HW_1, &gUartIfPdu);
        
        state = HEX_STATE_LEN;
        if(HAL_OK != HAL_UART_Receive_DMA(&gUart1Handle, &(gRxHexFrame.len), sizeof(gRxHexFrame.len)))
          {
          }
      }
      break;
    default:
      {
      }
      break;
  }
}
